# SampleValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellCombinedParameterData..::..SampleValue Property
TableCellCombinedParameterData Class See Also
---
The sample/example value for the parameter in text form
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string SampleValue { get; set; }
```

Visual Basic
---
```text
Public Property SampleValue As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SampleValue {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace